{
  "main": {
    "name": "Siddharth Bagai",
    "description": "A technologist who believes everything is possible when approached with a positive outlook",
    "image": "Siddharth.png",
    "bio": "Experienced Software Engineer with 17+ years in React, JavaScript, C++, OpenGl and QT. Delivered high- quality applications across diverse projects, including distributed systems, 3D visualization in Medtech, CAD, and GIS. Proficient in JavaScript, WebGl, ThreeJs optimizing performance, and efficient algorithm development. Passionate about three.js, OpenGL, and advanced graphics. Collaborative, detail-oriented, excels in communication. Dedicated to exceptional results, bringing wealth of skills and experience to software development. Committed to creating outstanding user experiences and making valuable impact.",
    "contactmessage": "Feel free to connect via mail, mobile, linkedin or whatssup",
    "email": "sids4ru@gmail.com",
    "phone": "+91 9717783737",
    "github": "https://github.com/sids4ru",
    "project": "https://www.linkedin.com/in/siddharthbagai",
    "address": {
      "street": "T11/ 1412, Purvanchal Royal Park",
      "city": "Noida",
      "state": "Uttar Pradesh, India",
      "zip": "201303"
    },
    "website": "https://s3.us-east-2.amazonaws.com/viz.ext/index.html",
    "resumedownload": "https://s3.us-east-2.amazonaws.com/viz.ext/Siddharth_concise_1.pdf",
    "social": [
      {
        "name": "facebook",
        "url": "https://www.facebook.com/siddharth.bagai/",
        "className": "fa fa-faceboo ̰ ̰k"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/siddharthbagai/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/bagaisiddharth/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/sids4ru",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "Primary Skills",
    "education": [
      {
        "school": "International Institute of Information Technology, Hyderabad",
        "degree": "Master of Technology",
        "graduated": "June 2006",
        "description": ""
      }
    ],
    "work": [
      {
        "company": "Microsoft, Noida",
        "title": "Senior Software Engineer",
        "years": "July 2021 - Present",
        "description": "Owned and developed boilerplate modules (Create, edit community)using React, TypeScript, GraphQL. Guided engineers in performance improvement of at-mentions through worker resolvers. Conducted code and design reviews, nurtured technical growth of the team. Led as a live site champ during DRI cycles, facilitated design thinking workshops for customer-centric features. Contributed to talent recognition, participated in interviews up to R3.Innovated FHL video hack and AI-based search enhancement in TFL. Tech stack: React, JavaScript, TypeScript, ADO, GraphQL, Git, copilot."
      },
      {
        "company": "Stryker, Gurgaon",
        "title": "Software Architect",
        "years": "August 2017 - July 2021",
        "description": "Led global team for ADAPT 2.1: I led a cross-functional team across India and Germany, successfully releasing the software. Specialized in surgery guidance software: I had expertise in ADAPT, guiding surgeons for femoral fractures using 2D X-Ray to 3D scene conversion. Managed projects and teams: I handled divisions, ensured collaboration, and coordinated visits for seamless development. Achieved track record of successful releases: I was recognized for delivering high-quality releases of ADAPT 2.1 software. Tech stack: C++, QT/QML, Jira, Jenkins, P4, QT Creator, Crank Storyboard"
      },
      {
        "company": "Samsung, Noida",
        "title": "Software Architect",
        "years": "October 2011 - July 2017",
        "description": "Vulkan porting: Successfully cross compiled Vulkan for Fox-P board. Led Stereoscopic Web team: Developed parallax algorithm, commercialized on 30 targets, recognized for exceptional skills. Optimized Embedded TV Web Browser: Achieved 150% faster launch, mentored for seamless user interaction. Commercialized Embedded TV Web Engine: Supported QA, integrated plugins, achieved Web kit commercialization. Enhanced rendering and support: Researched Ciro, Skia for better rendering, optimized performance, supported teams. Tech Stack: Vulkan, C++, STL, Web Kit, OpenGL ES, GTK."
      },
      {
        "company": "Rolta India, Mumbai",
        "title": "Manager",
        "years": "August 2009 - October 2011",
        "description": "Owned RFT: Client support, POC, QA, product release. Developed RFT features: Serialization, multi-tabs, pan/zoom, flight simulation, overlays, tiling performance. Integrated with Java UDIG. Improved ClearCase process: Reduced delivery time from a day to minutes. Created algorithms: Navigation, fly path. Used Observer, state machine, MVC, iterator. Commercialized RFT: Impressed BEL client. Tech Stack: C++, STL, OpenSceneGraph, OpenGL, WxWidgets, VTP, LibMini, multi- threading, Nasa World Wind , Java, IBM WebSphere, Oracle spatial, JOGL"
      },
      {
        "company": "Geometric, Pune",
        "title": "Software Engineer",
        "years": "November 2007 - August 2009",
        "description": "Led migration to OpenSceneGraph, improving performance. Developed picking infrastructure for user interaction. Responsible for maintenance, bug fixing, and testing. Implemented spline navigation for enhanced usability. Proposed new scene graph schema, achieving >100% FPS improvement. Tech Stack: C++, STL, OpenSceneGraph, QT, Nastran, Patran"
      },
      {
        "company": "Arup, Hyderabad",
        "title": "Software Engineer",
        "years": "January 2006 - November 2007",
        "description": "January 2006–November 2007. Tunset: Created OpenGL library for tunnel rendering, advanced features. Slope: Extended surfaces, proposed UX improvements, supported QA. Greta: Optimized wall base width algorithm using existing solver. Implemented numerical black box algorithm for quick width calculations. Achieved off-cycle promotion for log n algorithm. Tech-Stack: C++, STL, MFC, QT."
      }
    ],
    "skills": [
      {
        "name": "ReactJs",
        "level": "70%"
      },
      {
        "name": "TypeScript",
        "level": "55%"
      },
      {
        "name": "Scrum Master",
        "level": "60%"
      },
      {
        "name": "People Management",
        "level": "60%"
      },
      {
        "name": "ThreeJs",
        "level": "60%"
      },
      {
        "name": "AFrame",
        "level": "80%"
      },
      {
        "name": "NodeJs",
        "level": "30%"
      },
      {
        "name": "Yarn",
        "level": "30%"
      },
      {
        "name": "C++",
        "level": "50%"
      },
      {
        "name": "ADO",
        "level": "50%"
      },
      {
        "name": "Jira",
        "level": "50%"
      }
    ]
  }
}
